Org/Oracle/oracle_number.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>oracle_number</title>
<!-- 2016-03-25 Fri 16:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John" />
</head>
<body>
<div id="content">
<h1 class="title">oracle_number</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. NUMBER TYPE</a>
<ul>
<li><a href="#sec-1-1">1.1. consist of</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. 最高位表示位</a></li>
<li><a href="#sec-1-1-2">1.1.2. 数据部分</a></li>
<li><a href="#sec-1-1-3">1.1.3. 符号位</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> NUMBER TYPE</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> consist of</h3>
<div class="outline-text-3" id="text-1-1">
<p>
负数存在符号位;正数没有符号位;0只有最高位0x80,没有数据部分和符号位
oracle以一个字节表示两位
</p>
</div>
<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> 最高位表示位</h4>
<div class="outline-text-4" id="text-1-1-1">
</div><ol class="org-ol"><li><a id="sec-1-1-1-1" name="sec-1-1-1-1"></a>正数<br  /><div class="outline-text-5" id="text-1-1-1-1">
<p>
最高位 &gt; 0x80
当0    &lt; 正数 &lt; 100, 最高位是0xC1
当100  &lt;= 正数 &lt; 10000, 最高位是0xC2
&#x2026;
当0    &gt; 正数 &gt;= 0.01, 最高位是0xC0
当0.01 &gt; 正数 &gt;= 0.0001, 最高位是0xBF
&#x2026;
</p>
</div>
</li>
<li><a id="sec-1-1-1-2" name="sec-1-1-1-2"></a>负数<br  /><div class="outline-text-5" id="text-1-1-1-2">
<p>
最高位 &lt; 0x80
当 -100   &lt; 负数 &lt; 0, 最高位是0x3E
当 -10000 &lt;= 负数 &lt; -100, 最高位是0x3D
&#x2026;
当 -0.01 &lt; 负数 &lt; 0, 最高位是0x3F
当 -0.0001 &lt;= 负数 &lt; -0.01, 最高位是0x40 
&#x2026;
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> 数据部分</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
每个字节都表示2位数字, 0在正数时,数据部分是0x01 0在负数时,数据部分是0x65
同样, 99在正数时, 数据部分是0x64, 负数时,数据部分是0x20
其他都是用一个表示
eg: 1  ==&gt; 0x02    -1 ==&gt; 0x64 
    17 ==&gt; 0x12    -17 ==&gt; 0x54
</p>
</div>
</div>
<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> 符号位</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
    当数字为负数时, 才有符号位,符号位用0x66表示
eg: 
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">数字</th>
<th scope="col" class="right">oracle表示</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">0</td>
<td class="right">0x80</td>
</tr>

<tr>
<td class="right">1</td>
<td class="right">0xC102</td>
</tr>

<tr>
<td class="right">1234</td>
<td class="right">0xC20D23</td>
</tr>

<tr>
<td class="right">0.1</td>
<td class="right">0xC0B0</td>
</tr>

<tr>
<td class="right">0.0034</td>
<td class="right">0xBF23</td>
</tr>

<tr>
<td class="right">1234.1234</td>
<td class="right">0xC20D230D23</td>
</tr>

<tr>
<td class="right">-1</td>
<td class="right">0x3E6466</td>
</tr>

<tr>
<td class="right">-1234</td>
<td class="right">0x3D594366</td>
</tr>

<tr>
<td class="right">-0.1</td>
<td class="right">0x3F5B66</td>
</tr>

<tr>
<td class="right">0.0034</td>
<td class="right">0x404366</td>
</tr>

<tr>
<td class="right">-1234.1234</td>
<td class="right">0x3D5943594366</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John</p>
<p class="date">Created: 2016-03-25 Fri 16:36</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>